In [1]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv('Mall_Customers.csv')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [5]:
data.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [10]:
data.rename(columns={'Genre':'Gender'},inplace=True)

In [11]:
data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [12]:
data.rename(columns={'Annual Income (k$)':'Income'},inplace=True)

In [13]:
data

     CustomerID  Gender  Age  Income  Spending Score (1-100)
0             1    Male   19      15                      39
1             2    Male   21      15                      81
2             3  Female   20      16                       6
3             4  Female   23      16                      77
4             5  Female   31      17                      40
..          ...     ...  ...     ...                     ...
195         196  Female   35     120                      79
196         197  Female   45     126                      28
197         198    Male   32     126                      74
198         199    Male   32     137                      18
199         200    Male   30     137                      83

[200 rows x 5 columns]

In [14]:
data['Age'].mean()

38.85

In [25]:
data.mode(axis=1)

C:\Users\seasp\AppData\Local\Temp\ipykernel_19584\3574062467.py:1: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'int'
  data.mode(axis=1)

       0       1     2      3     4
0      1    Male  19.0   15.0  39.0
1      2    Male  21.0   15.0  81.0
2      3  Female  20.0   16.0   6.0
3      4  Female  23.0   16.0  77.0
4      5  Female  31.0   17.0  40.0
..   ...     ...   ...    ...   ...
195  196  Female  35.0  120.0  79.0
196  197  Female  45.0  126.0  28.0
197  198    Male  32.0  126.0  74.0
198  199    Male  32.0  137.0  18.0
199  200    Male  30.0  137.0  83.0

[200 rows x 5 columns]

In [27]:
data['Age'].std()

13.96900733155888

In [31]:
data.groupby(['Gender'])['Age'].mean()

Gender
Female    38.098214
Male      39.806818
Name: Age, dtype: float64

In [32]:
data['Age'].var()

195.13316582914572

In [33]:
data['Age'].min()

18